app/controllers/chats_controller.rb

  def index
    chats = current_user.chats
    @existing_chats_users = current_user.existing_chats_users
    @available_user = current_user.friendships.where(state:"approved")
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."state" = ?  [["user_id", 1], ["state", "approved"]]

  def create
    @other_user = User.find(params[:other_user])
    @chat = find_chat(@other_user) || Chat.new(identifier: SecureRandom.hex)
    if !@chat.persisted?
      @chat.save
      @chat.subscriptions.create(user_id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "chats" ("identifier", "created_at", "updated_at") VALUES (?, ?, ?)  [["identifier", "c401f83bb15150ea8894241e2b5d4670"], ["created_at", "2018-11-11 07:53:19.749211"], ["updated_at", "2018-11-11 07:53:19.749211"]]
INSERT INTO "subscriptions" ("chat_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["chat_id", 1], ["user_id", 1], ["created_at", "2018-11-11 07:53:19.765582"], ["updated_at", "2018-11-11 07:53:19.765582"]]

  def show
    @other_user = User.find(params[:other_user])
    @avatar = @other_user.images.first
    @my_avatar = current_user.images.first
    @chat = Chat.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def find_chat(second_user)
    chats = current_user.chats
    chats.each do |chat|
      chat.subscriptions.each do |s|
---
SELECT "chats".* FROM "chats" INNER JOIN "subscriptions" ON "chats"."id" = "subscriptions"."chat_id" WHERE "subscriptions"."user_id" = ?  [["user_id", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."chat_id" = ?  [["chat_id", 1]]