app/controllers/friendships_controller.rb

SELECT "images".* FROM "images" WHERE "images"."user_id" = ?  [["user_id", 1]]
---
  def index
    # @friendships = Friendship.all
    @gender = current_user.gender
    @suggest_user = User.where(gender: @gender)
    @images = (Image.all - current_user.images - Image.where(user_id: @suggest_user)).shuffle

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = 1 LIMIT ?  [["user_id", 27], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["friend_id", 27], ["created_at", "2018-11-11 07:52:47.268360"], ["updated_at", "2018-11-11 07:52:47.268360"]]
---
  def create
    #check friendship exist?
    friend_id = friendship_params[:friend_id]
    friendship = Friendship.find_by(user_id:friend_id, friend_id:current_user)
    my_friendship = Friendship.find_by(user_id:current_user, friend_id:friend_id)
    if friendship.blank? and my_friendship.blank?
      new_friendship = Friendship.new(user_id: current_user.id, friend_id: friendship_params[:friend_id])
      new_friendship.save