app/controllers/messages_controller.rb

  def create
    message = Message.new(message_params)
    message.user = current_user
    if message.save
      #broadcasting out to messages channel including the chat_id so messages are broadcasted to specific chat only
      ActionCable.server.broadcast( "messages_#{message_params[:chat_id]}",
                                    #message and user hold the data we render on the page using javascript
                                    message: message.content,
                                    user: message.user.name,
                                    id: message.user.id,
                                    image_link: message.user.images.first.link,
                                    image_file: message.user.images.first.file
      )
---
INSERT INTO "messages" ("content", "user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hii"], ["user_id", 1], ["chat_id", 1], ["created_at", "2018-11-11 07:53:25.622570"], ["updated_at", "2018-11-11 07:53:25.622570"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]